# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Sat Apr 18 14:56:59 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design top

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_false_path -from [get_ports rst]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports input_valid]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[144]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[143]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[142]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[141]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[140]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[139]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[138]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[137]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[136]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[135]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[134]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[133]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[132]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[131]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[130]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[129]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[128]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[127]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[126]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[125]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[124]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[123]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[122]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[121]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[120]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[119]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[118]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[117]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[116]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[115]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[114]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[113]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[112]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[111]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[110]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[109]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[108]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[107]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[106]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[105]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[104]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[103]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[102]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[101]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[100]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[99]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[98]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[97]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[96]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[95]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[94]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[93]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[92]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[91]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[90]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[89]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[88]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[87]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[86]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[85]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[84]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[83]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[82]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[81]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[80]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[79]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[78]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[77]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[76]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[75]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[74]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[73]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[72]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[71]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[70]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[69]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[68]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[67]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[66]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[65]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[64]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {order_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports output_ready]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports flush_in]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports input_ready]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports output_valid]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[175]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[174]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[173]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[172]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[171]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[170]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[169]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[168]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[167]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[166]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[165]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[164]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[163]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[162]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[161]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[160]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[159]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[158]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[157]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[156]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[155]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[154]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[153]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[152]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[151]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[150]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[149]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[148]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[147]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[146]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[145]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[144]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[143]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[142]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[141]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[140]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[139]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[138]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[137]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[136]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[135]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[134]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[133]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[132]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[131]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[130]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[129]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[128]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[127]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[126]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[125]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[124]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[123]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[122]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[121]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[120]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[119]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[118]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[117]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[116]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[115]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[114]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[113]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[112]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[111]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[110]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[109]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[108]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[107]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[106]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[105]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[104]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[103]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[102]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[101]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[100]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[99]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[98]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[97]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[96]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[95]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[94]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[93]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[92]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[91]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[90]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[89]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[88]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[87]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[86]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[85]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[84]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[83]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[82]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[81]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[80]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[79]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[78]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[77]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[76]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[75]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[74]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[73]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[72]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[71]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[70]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[69]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[68]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[67]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[66]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[65]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[64]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {trade_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports done]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {state_dbg[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {state_dbg[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {state_dbg[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {state_dbg[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {state_dbg[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {state_dbg[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {state_dbg[0]}]
set_wire_load_mode "enclosed"
